WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/RpcLit/SoapWsdl.BaseDataTypes.XmlFormatter.RpcLit_RetFloat_Client_Request-11.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesRpcLit/RetFloat</a:Action>
    <a:MessageID>urn:uuid:7a6199a3-f229-4b75-94e0-9700535db20b</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetFloat xmlns="http://tempuri.org/">
      <inFloat xmlns="">-3.14159274</inFloat>
    </RetFloat>
  </s:Body>
</s:Envelope>